feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/Psi5/Psi5/IfxPsi5_Psi5.h
/** \brief Input output configuration structure
 */
typedef struct
{
    boolean                         outputInverterEnabled;         /**< \brief Specifies the pulse polarity of the output */
    boolean                         inputInverterEnabled;          /**< \brief Specifies the pulse polarity of the input */
    IfxPsi5_DigitalInputFilterDepth digitalInputFilterDepth;       /**< \brief Specifies the the number of port input samples considered for floating average */
} IfxPsi5_Psi5_InputOutputControl;

/** \brief Psi5 serial message with individual members
 */
typedef struct
{
    uint16 serialData : 16;                       /**< \brief Serial message data */
    uint8  messageId : 8;                         /**< \brief Serial message Id */
    uint8  crc : 6;                               /**< \brief Serial message crc */
    uint8  serialMessageCRCFailedError : 1;       /**< \brief Serial message crc error flag */
    uint8  configuration : 1;                     /**< \brief Serial message configuration */
} IfxPsi5_Psi5_Message;

/** \brief Sync pulse generation configuration structure
 */
typedef struct
{
    uint32              pulseLength;                      /**< \brief Specifies the standard pulse width without data coding for standard pulse width or for coding a '0' */
    uint32              delayLength;                      /**< \brief Specifies the additional length of the pulse width for coding a '1' */
    IfxPsi5_TimeBase    timeBaseSelect;                   /**< \brief Specifies the clock source for CTV as internal or external */
    IfxPsi5_Trigger     externalTimeBaseSelect;           /**< \brief Specifies the clock source for CTV in the case of external */
    IfxPsi5_TriggerType periodicOrExternalOrBypass;       /**< \brief Specifies whether periodic trigger or external trigger or bypass is selected */
    IfxPsi5_Trigger     externalTriggerSelect;            /**< \brief Specifies the trigger source in case of external triggerring */
    uint32              blankoutTime;                     /**< \brief Specifies the duration of blank out period */
} IfxPsi5_Psi5_PulseGeneration;

/** \brief Psi5 frame in double word format
 */
typedef struct
{
    uint32 lowWord;        /**< \brief Lower 32 bits of the Psi5 frame */
    uint32 highWord;       /**< \brief Upper 32 bits of the Psi5 frame */
} IfxPsi5_Psi5_Rdm;

/** \brief Psi5 serial message as unsigned 32 bit value
 */
typedef struct
{
    uint32 value;       /**< \brief 32 bit value of the Psi5 serial message */
} IfxPsi5_Psi5_Rds;

/** \brief Receive control configuration structure
 */
typedef struct
{
    boolean                              asynchronousModeSelected;                       /**< \brief Specifies the asynchronous mode of operation */
    uint32                               fifoWarningLevel;                               /**< \brief Specifies the fifo warning level */
    uint32                               payloadLength[IFXPSI5_NUM_SLOTS];               /**< \brief Specifies the payload length for the slots 0 to 5 */
    IfxPsi5_Verbose                      verboseForAsynchronousMode;                     /**< \brief Specifies the verbose mode selection in asynchronous mode of operation */
    IfxPsi5_MessagingBits                messagingBitsPresence[IFXPSI5_NUM_SLOTS];       /**< \brief Specifies the presence or absence of messaging bits in the slots 0 to 5 */
    IfxPsi5_CRCorParity                  crcOrParity[IFXPSI5_NUM_SLOTS];                 /**< \brief Specifies the crc or parity selection for the slots 0 to 5 */
    IfxPsi5_FrameExpectation             frameExpectation[IFXPSI5_NUM_SLOTS];            /**< \brief Specifies whether the frame is expected or not in the slots 0 to 5 */
    IfxPsi5_Verbose                      verbose[IFXPSI5_NUM_SLOTS];                     /**< \brief Specifies the verbose is enabled or disabled for the slots 0 to 5 */
    IfxPsi5_BaudRate                     baudrateSelect;                                 /**< \brief Specifies the baudrate selection */
    IfxPsi5_TimestampRegister            pulseTimestampSelect;                           /**< \brief Specifies the timestamp register selection for pulses */
    IfxPsi5_TimestampRegister            frameTimestampSelect;                           /**< \brief Specifies the timestamp register selection for start of frames */
    IfxPsi5_ReceiveDataRegisterTimestamp receiveDataRegisterTimestamp;                   /**< \brief Specifies the pulse or start of frame based timestamp to be stored in receive data register RDRH */
} IfxPsi5_Psi5_ReceiveControl;

/** \brief Timestamp configuration data structure
 */
typedef struct
{
    IfxPsi5_Trigger  externalTimeBaseSelect;       /**< \brief Specifies the clock base for counter CTS in the case of external */
    IfxPsi5_TimeBase timeBaseSelect;               /**< \brief Specifies the clock source for CTS as internal or external */
} IfxPsi5_Psi5_TimeStampConfig;

/** \brief Transmit control configuration structure
 */
typedef struct
{
    boolean enhancedProtocolSelected;                 /**< \brief Specifies whether the enhanced protocol is selected or not */
    boolean bitStuffingEnabled;                       /**< \brief Specifies whether the bit stuffing is turned on or not */
    boolean crcGenerationEnabled;                     /**< \brief Specifies whether the crc generation is turned on or not */
    boolean startSequenceGenerationEnabled;           /**< \brief Specifies whether the start sequence generation is turned on or not */
    boolean inhibitingAutomaticTransferEnabled;       /**< \brief Specifies whether automatic transfer from the shift registers SSRL/H to SORL/H is inhibited or not */
    uint32  payloadLength;                            /**< \brief Specifies the payload length to be sent */
    uint32  ssrPayloadLength;                         /**< \brief Specifies the payload length of SSR */
    uint32  sorPayloadLength;                         /**< \brief Specifies the payload length of SOR */
} IfxPsi5_Psi5_TransmitControl;

