feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/iLLD/TC27D/Tricore/Psi5/Psi5/IfxPsi5_Psi5.h
/** \brief Initialize the channel with the supplied configuration
 * \param channel pointer to the PSI5 channel
 * \param config pointer to the PSI5 channel configuration
 * \return TRUE on success & FALSE if configuration not valid
 *
 * A coding example can be found in \ref IfxLld_Psi5_Psi5_Usage
 *
 */
IFX_EXTERN boolean IfxPsi5_Psi5_initChannel(IfxPsi5_Psi5_Channel *channel, const IfxPsi5_Psi5_ChannelConfig *config);

/** \brief Get the current channel configuration (e.g. sample settings)
 * \param config pointer to the PSI5 channel configuration
 * \param psi5 pointer to the PSI5 module
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Psi5_Psi5_Usage
 *
 */
IFX_EXTERN void IfxPsi5_Psi5_initChannelConfig(IfxPsi5_Psi5_ChannelConfig *config, IfxPsi5_Psi5 *psi5);

/** \brief Gets the received psi5 frame for the channel
 * \param channel pointer to the PSI5 channel
 * \param frame pointer to the PSI5 frame buffer
 * \return TRUE if successful; FALSE if no frame available
 *
 * A coding example can be found in \ref IfxLld_Psi5_Psi5_Usage
 *
 */
IFX_EXTERN boolean IfxPsi5_Psi5_readChannelFrame(IfxPsi5_Psi5_Channel *channel, IfxPsi5_Psi5_Frame *frame);

/** \brief Get the received serial message for the channel
 * \param channel pointer to the PSI5 channel
 * \param slot Slot Id
 * \param message pointer to the PSI5 serial message buffer
 * \return TRUE if successful; FALSE if no serial message available
 */
IFX_EXTERN boolean IfxPsi5_Psi5_readChannelSerialMessage(IfxPsi5_Psi5_Channel *channel, IfxPsi5_Slot slot, IfxPsi5_Psi5_SerialMessage *message);

/** \brief Transmit the data through the channel
 * \param channel pointer to the PSI5 channel
 * \param data data to be sent
 * \return TRUE if successful; FALSE otherwise
 *
 * A coding example can be found in \ref IfxLld_Psi5_Psi5_Usage
 *
 */
IFX_EXTERN boolean IfxPsi5_Psi5_sendChannelData(IfxPsi5_Psi5_Channel *channel, uint64 data);

/** \} */

/** \addtogroup IfxLld_Psi5_Psi5_Clock
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Returns the configured fracDiv psi5 clock frequency in Hz.
 * \param psi5 Pointer to the base of PSI5 registers
 * \return Returns the configured fracDiv psi5 clock frequency in Hz.
 */
IFX_EXTERN uint32 IfxPsi5_Psi5_getFracDivClock(Ifx_PSI5 *psi5);

/** \brief Configure the fracDiv clock.
 * \param psi5 Pointer to the base of PSI5 registers
 * \param clock Specifies the required clock frequency in Hz.
 * \return Returns the configured clock frequency in Hz.
 */
IFX_EXTERN uint32 IfxPsi5_Psi5_initializeClock(Ifx_PSI5 *psi5, const IfxPsi5_Psi5_Clock *clock);

/** \} */

/******************************************************************************/
/*---------------------Inline Function Implementations------------------------*/
/******************************************************************************/

IFX_INLINE boolean IfxPsi5_Psi5_startupChannel(IfxPsi5_Psi5_Channel *channel, IfxPsi5_Psi5_StartupOptions *options)
{
    IFX_UNUSED_PARAMETER(channel);
    IFX_UNUSED_PARAMETER(options);
    return TRUE;
}


#endif /* IFXPSI5_PSI5_H */
